<template>
  <h2>Доступная среда</h2>
  <div class="card-item">
    <div>
      ГБУЗ «Морозовская ДГКБ ДЗМ» не имеет в составе обучающихся инвалидов и лиц с ограниченными возможностями, однако по заявлению
      обучающегося в организации предусмотрено создание специальных адаптированных программ и условий для обучения таких ординаторов и
      аспирантов.
    </div>
    <div>
      Лица с ограниченными возможностями уже сейчас имеют беспрепятственный доступ в больницу, могут пользоваться электронными библиотеками,
      сотрудничающими с нами, заходить и пользоваться ЭОС, использовать компьютеры или планшеты (по заявлению) с выходом интернет, обучаться
      в классах, где ведутся занятия. В здании больнице имеется бесплатный Wi-Fi, позволяющий обучающимся пользоваться электронной средой со
      своих мобильных устройств.
    </div>
    <div>
      В связи с отсутствием в учебном плане ординаторов и аспирантов дисциплины «Физическая культура» в больнице не имеются объекты спорта,
      приспособленных для обучения инвалидами и лицами с ограниченными возможностями здоровья, однако они могут беспрепятственно
      пользоваться тренажерным залом.
    </div>
    <div>
      Больница располагает кафе, где созданы условия для питания инвалидов и лиц с ограниченными возможностями, медицинскими кабинетами и
      реабилитационными помещениями, позволяющими заботиться о здоровье обучающихся.
    </div>
    <div>Больница не располагает общежитием для обучающихся.</div>
  </div>
  <ul>
    <li>
      <a
        target="_blank"
        href="http://мороздгкб.рф/wp-content/uploads/2017/06/%D0%9F%D0%BE%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BE%D0%B1-%D0%BE%D1%80%D0%B3%D0%B0%D0%BD%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8-%D0%BE%D0%B1%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D1%8F-%D0%B8%D0%BD%D0%B2%D0%B0%D0%BB%D0%B8%D0%B4%D0%BE%D0%B2-%D0%B8-%D0%BB%D0%B8%D1%86-%D1%81-%D0%BE%D0%B3%D1%80%D0%B0%D0%BD%D0%B8%D1%87%D0%B5%D0%BD%D0%BD%D1%8B%D0%BC%D0%B8-%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D1%8F%D0%BC%D0%B8-%D0%B7%D0%B4%D0%BE%D1%80%D0%BE%D0%B2%D1%8C%D1%8F.pdf"
      >
        Положение об организации обучения инвалидов и лиц с ограниченными возможностями здоровья
      </a>
    </li>
  </ul>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue';

export default defineComponent({
  name: 'InvalidsPage',

  setup() {
    const mounted = ref(false);

    return {
      mounted,
    };
  },
});
</script>
<style lang="scss" scoped>
@import '@/assets/styles/elements/ordinatura.scss';
.el-descriptions__label {
  font-size: 15px;
}
</style>
