<template>
  <h2>Стипендии и иные виды материальной поддержки</h2>
  <div class="card-item">
    <h4>О наличии и условиях предоставления стипендии</h4>
    <div>
      Стипендии ординаторам, обучающимся на основе договора заключаемого в рамках целевой контрактной подготовки специалистов в ординатуре
      за счет бюджета города Москвы, выплачиваются ГБУЗ «Морозовская ДГКБ».
    </div>
    <div>Средства, на обеспечение расходов, связанных с выплатой стипендии, выделяются Департаментом здравоохранения города Москвы.</div>
  </div>

  <div class="card-item">
    <h4>О мерах социальной поддержки</h4>
    <div>Бесплатное обеспечение доступа к изданиям электронной библиотеки «Консультант врача»</div>
    <div>Психологическое сопровождение и консультирование обучающихся по вопросам адаптации, конфликтных ситуаций и т. п.</div>
    <div>Бесплатное посещение спортивного зала для занятий фитнесом на территории больницы</div>
    <div>Бесплатный Wi-Fi, а также доступ в сеть Интернет со стационарных компьютеров организации.</div>
  </div>

  <div class="card-item">
    <h4>
      О наличии общежития, интерната. О количестве жилых помещений в общежитии для иногородних обучающихся. О формировании платы за
      проживание в общежитии.
    </h4>
    <div>Общежитие ГБУЗ «Морозовская ДГКБ» не предоставляется.</div>
  </div>

  <div class="card-item">
    <h4>О трудоустройстве выпускников</h4>
    <div>
      Согласно данным реестра Департамента здравоохранения по трудоустройству выпускников обучившиеся за счет средств бюджета субъекта
      Российской Федерации (г. Москвы) трудоустроены по специальности — 100%
    </div>
    <div>
      Согласно данным опроса выпускников, завершивших обучение по договорам о платных образовательных услугах — трудоустройство по
      специальности 100%
    </div>
  </div>

  <el-table :data="stud">
    <el-table-column label="Наименование специальности/подготовки" prop="name"> </el-table-column>
    <el-table-column prop="free" label="Ординаторы, обучившиеся за счёт средств бюджета субъекта Российской Федерации г.Москвы)">
    </el-table-column>
    <el-table-column prop="paid" label="Ординаторы, завершившие обучение по договорам о платных образовательных услугах"> </el-table-column>
    <el-table-column prop="all" label="Всего ординаторов"> </el-table-column>
    <el-table-column prop="work" label="Из них трудоустроено"> </el-table-column>
  </el-table>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue';

export default defineComponent({
  name: 'MoneyPage',

  setup() {
    const mounted = ref(false);

    const stud: any = [
      {
        name: '31.08.16 Детская хирургия',
        free: '2',
        paid: '4',
        all: '6',
        work: '6',
      },
      {
        name: '31.08.17 Детская эндокринология',
        free: '1',
        paid: '5',
        all: '6',
        work: '6',
      },
      {
        name: '31.08.16 Педиатрия',
        free: '35',
        paid: '14',
        all: '49',
        work: '49',
      },
      {
        name: '31.08.16 Оториноларингология',
        free: '3',
        paid: '7',
        all: '10',
        work: '10',
      },
      {
        name: '31.08.16 Офтальмология',
        free: '2',
        paid: '2',
        all: '4',
        work: '4',
      },
    ];

    return {
      stud,

      mounted,
    };
  },
});
</script>
<style lang="scss" scoped>
@import '@/assets/styles/elements/ordinatura.scss';
.el-descriptions__label {
  font-size: 15px;
}
</style>
