<template>
  <div class="card-item">
    <h4 style="text-align: center">Базовые программы</h4>
    <el-table :data="basePrograms" border direction="horizontal">
      <el-table-column label="Программа" prop="program" />
      <el-table-column label="Кол-во часов" prop="hours" />
      <el-table-column label="Стоимость" prop="cost" />
    </el-table>
  </div>
  <div class="card-item">
    <h4 style="text-align: center">Дополнительные профессиональные программы до 36 часов по госзаданию на 2019 год</h4>
    <el-table :data="additionalPrograms" border direction="horizontal">
      <el-table-column label="Программа" width="600" prop="name" />
      <el-table-column label="Дата" prop="teacher" />
      <el-table-column label="Часов" prop="hours" width="70" />
      <el-table-column label="Время" prop="start" width="100" />
      <el-table-column label="Слушателей" width="120" prop="listeners" />
    </el-table>
  </div>

  <div class="card-item">
    <ul>
      <li v-for="file in ped" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
    </ul>
  </div>
  <div class="card-item">
    <div class="card-item">
      <div>
        Информируем Вас о том, что ГБУЗ «Морозовская ДГКБ ДЗМ» с 20.09.2021 по 18.10.202, с 19.10.2021 по 18.11.201, с 22.11.2021 по
        17.12.2021 года организует проведение цикла повышения квалификации «Педиатрия». Образовательная программа включена в систему
        непрерывного медицинского образования.
      </div>
      <div>Для получения баллов НМО слушателям будет необходимо:</div>
      <div>
        Прослушать необходимое количество времени онлайн-лекции образовательной программы, аккредитованной НМО. Подтвердить своё присутствие
        на экране по ходу трансляции необходимое количество раз. Свидетельства НМО направляются по электронной почте слушателям, выполнившим
        необходимые условия.
      </div>
      <div>Используя индивидуальный код, полученные кредиты будут зачтены в личном кабинете слушателя на сайте edu.rosminzdrav.ru.</div>
      <div>Форма обучения: очно-заочная (с применением дистанционных технологий)</div>
      <div>Продолжительность обучения: 144 часа (144 ЗЕТ)</div>
      <div>Контингент: врачи-педиатры учреждений Департамента здравоохранения города Москвы.</div>
      <div>Обучение на бюджетной основе (за счет средств ДЗМ).</div>
      <div>
        Дополнительную информацию по вопросам обучения можно получить у специалиста отдела постдипломного образования ГБУЗ «Морозовская
        детская городская клиническая больница» ДЗМ Боголюбской Юлии Вячеславовны.
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent, onBeforeMount } from 'vue';

export default defineComponent({
  name: 'AdditionalEducationPrograms',
  components: {},

  setup() {
    const fileInfos = ['Инструкция по записи на цикл НМО', 'Презентация по циклу НМО Педиатрия'];
    const ped: any = [];

    onBeforeMount(() => {
      const url = process.env.VUE_APP_STATIC_URL + '/educ/dop/ped/';
      fileInfos.forEach((f: string, i: number) => {
        ped.push({ url: url + i + '.pdf', download: f });
      });
    });

    const basePrograms = [
      {
        program: 'Повышение квалификации',
        hours: '36',
        cost: '10 000',
      },
      {
        program: 'Повышение квалификации',
        hours: '72',
        cost: '15 000',
      },
      {
        program: 'Повышение квалификации',
        hours: '144',
        cost: '25 000',
      },
      {
        program: 'Профессиональная подготовка',
        hours: '252',
        cost: '50 000',
      },
    ];

    const additionalPrograms = [
      {
        name: 'Ультразвуковые исследования в андрологии детского и подросткового возраста',
        teacher: 'Тарусин Дмитрий Игоревич',
        start: '16.09.19',
        listeners: '25',
      },
      {
        name: 'Ультразвуковые исследования в андрологии детского и подросткового возраста',
        teacher: 'Тарусин Дмитрий Игоревич',
        start: '18.11.19',
        listeners: '25',
      },
      {
        name: 'Актуальные аспекты ведения пациентов детского возраста с воспалительными заболеваниями кишечника',
        teacher: 'Скворцова Тамара Андреевна',
        start: '22.07.19',
        listeners: '25',
      },
      {
        name: 'Актуальные аспекты ведения пациентов детского возраста с воспалительными заболеваниями кишечника',
        teacher: 'Скворцова Тамара Андреевна',
        start: '14.10.19',
        listeners: '25',
      },
      {
        name: 'Воспалительные заболевания суставов у детей',
        teacher: 'Валиева Сания Ирикова',
        start: '05.11.19',
        listeners: '25',
      },
      {
        name: 'Роль ЭФИ исследований у детей с патологией органа зрения',
        teacher: 'Тумасян Александр Рафаэлович',
        start: '24.09.19',
        listeners: '25',
      },
      {
        name: 'Ультрозвуковая диагностика в детской гинекологии',
        teacher: 'Галкина Янина Анатольевна',
        start: '21.10.19',
        listeners: '25',
      },
      {
        name: 'Современные методы хирургических вмешательств в детской колопроктологии',
        teacher: 'Поддубный Игорь Витальевич',
        start: '09.12.19',
        listeners: '25',
      },
      {
        name: 'Эхокардиография в педиатрии',
        hours: '36',
        teacher: 'Абрамян Михаил Арамович',
        start: '26.08.19',
        listeners: '25',
      },
      {
        name: 'Организации оказания медицинской помощи детям, имеющим ограничения жизнедеятельности, в образовательных организациях',
        hours: '18',
        teacher: 'Витковская Ирина Петровна',
        start: '23.09.19',
        listeners: '25',
      },
      {
        name: 'Остеосинтез эластичными интрамедуллярными штифтами при переломах длинных трубчатых костей у детей',
        hours: '36',
        teacher: 'Петров Михаил Анатольевич',
        start: '22.07.19',
        listeners: '25',
      },
      {
        name: 'Организационно-методическое обеспечение оказания медицинской помощи детям в условиях многопрофильного стационара',
        hours: '36',
        teacher: 'Витковская Ирина Петровна',
        start: '02.12.19',
        listeners: '25',
      },
      {
        name: 'Острый живот у детей. Клиника, диагностика, лечение',
        teacher: 'Поддубный Игорь Витальевич',
        start: '14.10.19',
        listeners: '25',
      },
      {
        name: 'Мультидисциплинарный подход при лечении детей со спастическими синдромами',
        teacher: 'Филижанко Тарас Владимирович',
        start: '94.10.19',
        listeners: '25',
      },
      {
        name: 'Острые нарушения мозгового кровообращения у детей и подростков',
        teacher: 'Щедеркина Инна Олеговна',
        start: '01.12.19',
        listeners: '25',
      },
    ];

    return { basePrograms, additionalPrograms, ped };
  },
});
</script>
<style lang="scss" scoped>
@import '@/assets/styles/elements/ordinatura.scss';
.el-descriptions__label {
  font-size: 15px;
}
</style>
