<template>
  <div class="card-item">
    <ul>
      <h2>Образование</h2>
      <li v-for="file in filesDocs" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
    </ul>
  </div>

  <div class="card-item">
    <ul>
      <h2>Реализуемые программы</h2>
      <div>
        В больнице не реализуются адаптированные образовательные программы в связи с отсутствием обучающихся, нуждающихся в таком форме
        обучения.
      </div>

      <li v-for="file in filesProgs" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
      <h4>Образовательные программы ординатура</h4>
      <div v-for="file in progsOrd" :key="file.url">
        <div>
          <b>31.08.{{ file.code }}</b> <span>{{ file.name }}</span>
          <ul>
            <h5>2020-2022 учебный год</h5>
            <li v-for="first in file['22']" :key="first.url">
              <a target="_blank" :href="first.url" :download="first.download">{{ first.download }}</a>
            </li>
          </ul>
          <ul>
            <h5>2021-2023 учебный год</h5>
            <li v-for="first in file['23']" :key="first.url">
              <a target="_blank" :href="first.url" :download="first.download">{{ first.download }}</a>
            </li>
          </ul>
        </div>
      </div>
      <h2>Образовательные программы аспирантура</h2>
      <li v-for="file in aspFiles" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
      <div v-for="group in aspGroups" :key="group.name">
        <div>
          <b>{{ group.name }}</b>
          <ul>
            <h5>2020-2022 учебный год</h5>
            <li v-for="first in group.files" :key="first.url">
              <a target="_blank" :href="first.url" :download="first.download">{{ first.download }}</a>
            </li>
          </ul>
        </div>
      </div>
    </ul>
  </div>
  <div class="card-item">
    <ul>
      <h2>Методические рекомендации</h2>
      <li v-for="file in metFiles" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
    </ul>
  </div>
  <div class="card-item">
    <ul>
      <h2>Локальные акты разработанные ОПО (отделом постдипломного образования)</h2>
      <li v-for="file in locFiles" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
    </ul>
  </div>
  <div class="card-item">
    <ul>
      <h2>Сведения об обучающихся рекомендации</h2>
      <li v-for="file in studFiles" :key="file.url">
        <a target="_blank" :href="file.url" :download="file.download">{{ file.download }}</a>
      </li>
    </ul>
  </div>
</template>

<script lang="ts">
import { defineComponent, onBeforeMount } from 'vue';

export default defineComponent({
  name: 'EducationPage',
  setup() {
    const docs = [
      'Лицензия на осуществление образовательной деятельности',
      'Приказ о внесении изменений в лицензию',
      'ВЫПИСКА из реестра лицензий на осуществление образовательной деятельности',
      'Научная деятельность',
    ];

    const progs = ['Реализуемые образовательные программы (аспирантура, ординатура)', 'Реализуемые образовательные программы ДПО'];

    const filesDocs: any = [];
    const filesProgs: any = [];
    const progsOrd = [
      { code: '02', name: 'Анестезиология и реаниматология, очная форма обучения, срок обучения – 2 года', '22': [], '23': [] },
      {
        code: '05',
        name: 'Клиническая лабораторная диагностика, очная форма обучения, срок обучения – 2 года',
        single: false,
        '22': [],
        '23': [],
      },
      { code: '07', name: 'Патологическая анатомия, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
      { code: '13', name: 'Детская кардиология, очная форма обучения, срок обучения – 2 года', single: true, '22': [], '23': [] },
      { code: '14', name: 'Детская онкология, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
      { code: '15', name: 'Детская урология-андрология, очная форма обучения, срок обучения – 2 года', single: true, '22': [], '23': [] },
      { code: '16', name: 'Детская Хирургия, очная форма обучения, срок обучения - 2 года', single: false, '22': [], '23': [] },
      { code: '17', name: 'Детская Эндокринология, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
      { code: '18', name: 'Неонатология, очная форма обучения, срок обучения – 2 года', single: true, '22': [], '23': [] },
      { code: '19', name: 'Педиатрия, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
      { code: '29', name: 'Гематология и реаниматология, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
      { code: '58', name: 'Оториноларингология, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
      { code: '59', name: 'Офтальмология, очная форма обучения, срок обучения – 2 года', single: false, '22': [], '23': [] },
    ];
    const ordFiles = [
      'Основная профессиональная программа Высшего образования',
      'Аннотации рабочих программ дисциплин',
      'График учебного процесса',
      'Учебный план',
    ];

    const asp = [
      'Программа – минимум кандидатского экзамена по курсу «История и философия науки», «История медицины»',
      'Программа – минимум кандидатского экзамена по курсу «История и философия науки», «Философия естественных наук»',
      'Программа – минимум кандидатского экзамена по общенаучной дисциплине «Иностранный язык»',
    ];

    const aspFiles: any = [];

    const aspFiles2 = [
      'Основная профессиональная образовательная программа',
      'Программа-минимум кандидатского экзамена по специальности «Детская хирургия» по медицинским наукам',
      'Аннотации рабочих программ дисциплин',
      'Учебный график (заочное отделение)',
      'Учебный план (заочное отделение)',
    ];

    const aspGroups = [
      { name: 'Направленность: Детская Хирургия. Форма обучения заочная, срок обучения 3 года 6 месяцев', files: [] },
      { name: 'Направленность: Педиатрия. Форма обучения заочная, срок обучения 3 года 6 месяцев', files: [] },
      { name: 'Направленность: Детская эндокринология. Форма обучения заочная, срок обучения 3 года 6 месяцев', files: [] },
      { name: 'Направленность: Глазные болезни. Форма обучения заочная, срок обучения 3 года 6 месяцев', files: [] },
    ];

    const met = [
      'Аллергический ринит у детей',
      'Амплитудно-интегрированная электроэнцефалография в оценке функционального состояния центральной нервной системы у новорожденных различного гестационного возраста',
      'Ведение новорожденных с респираторным дистресс-синдромом',
      'Внебольничная пневмония у детей',
      'Детский церебральный паралич и эпилепсия. Современные подходы к лечению',
      'Диагностика и лечение гемолитической болезни новорожденных',
      'Дифференциальная диагностика болевых синдромов в клинике лор-болезней',
      'Инструкция по диагностике и лечению острых хирургических заболеваний органов брюшной полости в медицинских организациях государственной системы здравоохранения г. Москвы',
      'Клинические рекомендации по диагностике и лечению болезни Ниманна-Пика, тип С',
      'Клинические рекомендации по оказанию медицинской помощи пациентам с болезнью Помпе',
      'Коррекционная работа по речевому развитию детей раннего возраста с последствиями перинатального поражения нервной системы и детским церебральным параличом',
      'Коррекция когнитивных нарушений у детей и подростков',
      'Круп у детей. Острый обструктивный ларингит мкб-10 j 05.0',
      'Лечение детей с синдромом короткой кишки',
      'Лечение и реабилитация детей со спастическими формами церебрального паралича',
      'Недостаточность питания у детей раннего возраста. Принципы нутритивной поддержки',
      'Неонатальный скрининг с целью раннего выявления критических врожденных пороков сердца',
      'Обезболивание взрослых и детей при оказании медицинской помощи',
      'Острые фронтиты у детей',
      'Оценка функционального состояния детей и подростков с неврологической патологией с целью определения их возможностей для занятия физической культурой и спортом',
      'Парентеральное питание новорожденных',
      'Патология в рисунках',
      'Предоперационное обследование и хирургическое лечение пациентов с сенсоневральной тугоухостью IV степени и глухотой',
      'Протокол ведения пацинстов с нервной анорексией в условиях стационара',
      'Ранняя диагностика нарушений развития речи. Особенности речевого развития у детей с последствиями перинатальной патологии нервной системы',
      'Реабилитация пациентов после кохлеарной имплантации',
      'Рекомендации и алгоритм при детском аллергический рините',
      'Современные подходы к лечению деформаций перегородки носа у детей',
      'Учебное пособие по оказанию скорой медицинской помощи детям на догоспитальном этапе',
      'Федеральные клинические рекомендации (протокол) по оказанию медицинской помощи пациентам с несовершенным остеогенезом',
      'Федеральные клинические рекомендации (протокол) по оказанию меидцинской помощи пациентам с гипофосфазией',
      'Федеральные клинические рекомендации по диагностике и лечению болезни вильсона-коновалова (гепатолентикулярная дегенерация)',
      'Федеральные клинические рекомендации по диагностике и лечению болезни Фабри',
      'Федеральные клинические рекомендации по оказанию медицинском помощи детям с галактоземией',
      'Энтеральное вскармливание недоношенных детей',
      'Алгоритмы специализированной медицинской помощи больным сахарным диабетом',
      'Гинекологические заболевания у детей и подростков. Вопросы организации профилактических мероприятий.',
      'Селективный скрининг на наследственные болезни обмена веществ.',
      'Регистры редких (орфанных) заболеваний.Алгоритм предоставления сведений о пациенте с редким орфанным) заболеванием в региональный сегмент федерального регистра.',
      'Федеральные клинические рекомендации (протоколы) по ведению детей с эндокринными заболеваниями.',
      'Компьютерная и магнитно-резонансная томография в диагностике острого нарушения мозгового кровообращения у детей.',
    ];

    const loc = [
      'Порядок организации и осуществления образовательной деятельности по образовательным программам высшего образования — программам ординатуры',
      'Порядок организации и осуществления образовательной деятельности по образовательным программам высшего образования — программам аспирантуры',
      'Положение о самостоятельной работе обучающихся',
      'Положение о порядке формирования, выбора и изучения факультативных и элективных дисциплин',
      'Концепция воспитательной работы ГБУЗ «Морозовская ДГКБ ДЗМ»',
      'Порядок проведения итоговой (государственной итоговой) аттестации по образовательным программам высшего образования — программам подготовки научно-педагогических кадров в аспирантуре и ординатуре',
      'Положение о порядке подачи и рассмотрения апелляций в период проведения итоговой (государственной) аттестации',
      'Положение о порядке освоения образовательных программ высшего образования',
      'Положение об обучении ординаторов и аспирантов по индивидуальному плану и индивидуальному графику',
      'Положение о практике обучающихся, осваивающих основные профессиональные образовательные программы высшего образования по программам ординатуры и аспирантуры',
      'Положение о переаттестации дисциплин, обучающихся по программам ординатуры и аспирантуры',
      'Положение об организации учебного процесса по образовательным программам высшего образования в ГБУЗ «Морозовская ДГКБ ДЗМ»',
      'Положение о предоставлении академических отпусков',
      'Положение о языке образования В ГБУЗ «Морозовская ДГКБ ДЗМ»',
      'Положение об охране здоровья обучающихся',
      'Положение об организации обучения инвалидов и лиц с ограниченными возможностями здоровья',
    ];

    const stud = [
      'Сведения о результатах приема',
      'Численность обучающихся по реализуемым образовательным программам за счет бюджета г. Москвы и по договорам об образовании за счет средств физических и лиц в 2020/2021 учебном году',
      'Общая численность обучающихся по направлениям подготовки (аспирантура, ординатура)',
    ];

    const metFiles: any = [];
    const locFiles: any = [];
    const studFiles: any = [];
    onBeforeMount(() => {
      let url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/docs/';
      docs.forEach((f: string, i: number) => {
        filesDocs.push({ url: url + i + '.pdf', download: f });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/';
      progs.forEach((f: string, i: number) => {
        filesProgs.push({ url: url + i + '.pdf', download: f });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/ord/';
      progsOrd.forEach((f: any) => {
        ordFiles.forEach((file: string, i: number) => {
          if (!f.single) {
            f['22'].push({ url: url + f.code + '/22/' + i + '.pdf', download: file });
          }
          f['23'].push({ url: url + f.code + '/23/' + i + '.pdf', download: file });
        });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/asp/';
      asp.forEach((f: string, i: number) => {
        aspFiles.push({ url: url + i + '.pdf', download: f });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/asp/';
      aspGroups.forEach((group: any, i: number) => {
        aspFiles2.forEach((f: string, j: number) => {
          group.files.push({ url: url + i + '/' + j + '.pdf', download: f });
        });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/met';
      met.forEach((f: string, i: number) => {
        metFiles.push({ url: url + i + '.pdf', download: f });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/loc';
      loc.forEach((f: string, i: number) => {
        locFiles.push({ url: url + i + '.pdf', download: f });
      });

      url = process.env.VUE_APP_STATIC_URL + '/educ/info/educ/progs/stud';
      stud.forEach((f: string, i: number) => {
        studFiles.push({ url: url + i + '.pdf', download: f });
      });
    });

    return {
      studFiles,
      locFiles,
      metFiles,
      aspFiles,
      aspGroups,
      progsOrd,
      filesDocs,
      filesProgs,
    };
  },
});
</script>

<style lang="scss" scoped>
@import '@/assets/styles/elements/ordinatura.scss';
.el-descriptions__label {
  font-size: 15px;
}
</style>
