export const textFieldsAndDocuments = [
  'DiplomaNumber',
  'DiplomaSeries',
  'DiplomaDate',
  'UniversityEndYear',
  'UniversityName',
  'DiplomaSpeciality',
  'ContractDzm',
];

export const steps = [
  'Выберите программу',
  'Ответьте на вопросы',
  'Заполните личные данные',
  'Данные об образовании',
  'Индивидуальные достижения',
  'Загрузите пакет документов',
];
export const templateAlert = `<p>ВЫ ЗАВЕРШИЛИ ВНЕСЕНИЕ ОСНОВНЫХ ДАННЫХ, ВАМ БУДЕТ ПРЕДЛОЖЕНО СКАЧАТЬ И РАСПЕЧАТАТЬ ЧАСТИЧНО ЗАПОЛНЕННОЕ СИСТЕОМЙ ЗАЯВЛЕНИЕ:</p>
        <p>1. ПРОВЕРЬТЕ ПРАВИЛЬНОСТЬ ВСЕХ ВНЕСЕННЫХ ДАННЫХ</p>
        <p>2. ЗАПОЛНИТЕ НЕДОСТАЮЩИЕ ДАННЫЕ ОТ РУКИ СИНИМИ ЧЕРНИЛАМИ</p>
        <p>3. ПОСТАЬТЕ ПОДПИСИ ПО ОЗНАКОМЛЕНИЮ С ДОКУМЕНТАМИ</p>
        <p>4. ВНЕСИТЕ ПАСПОРТНЫЕ ДАННЫЕ</p>
        <p>5. ПОСТАВЬТЕ ЗАКЛЮЧИТЕЛЬНУЮ ПОДПИСЬ И ДАТУ ОФОРМЛЕНИЯ ЗАЯВЛЕНИЯ</p>
        <br />
        <p>ПРИ НАЛИЧИИ ОШИБОК ИСПРАВЬТЕ НА САЙТЕ И ЗАНОВО РАСПЕЧАТАЙТЕ ФОРМУ</p>
        `;

export const licensyText = `
            <p>
              Лицензией на ведение образовательной деятельности по образовательным программам послевузовского образования №
              Л035-00115-77/00096790 от «02» февраля 2015 г
            </p>
            <p>
              Свидетельством о государственной аккредитации по имеющим государственную аккредитацию образовательным программам № 2645 от
              «17» июля 2017 г. серия 90А01, номер бланка 0002774
            </p>
            <p>
              Уставом и Правилами внутреннего распорядка ГБУЗ «Морозовская детская городская клиническая больница Департамента
              здравоохранения города Москвы»
            </p>
            <p>
              Правилами приема, утвержденными ГБУЗ «Морозовская ДГКБ ДЗМ», в том числе с правилами подачи апелляции по результатам
              вступительного испытания
            </p>
        `;
export const privacyText = `
            <p>
              <a
                target="_blank"
                href="/files/privacy.pdf"
                download="Согласие на обработку своих персональных данных МДГКБ"
                class="info-text"
              >
                Согласие на обработку своих персональных данных,
              </a>
              <!-- Согласие на обработку своих персональных данных -->в том числе: фамилии, имени, отчества, паспортных данных, даты и места
              рождения, данных о прописке и фактическом месте проживания, телефонных номеров, адресов электронной почты, фотографии, образца
              личной подписи, профессиональной подготовке и образовании, в информационных системах, базах и банках данных в порядке,
              установленном Федеральным законом от 27 июля 2006 г. N152-ФЗ «О персональных данных» (Собрание законодательства Российской
              Федерации, 2006, N31, ст. 3451).
            </p>
            <p>
              В случае поступления в ГБУЗ «Морозовская детская городская клиническая больница Департамента здравоохранения города Москвы»
              согласен с передачей вышеуказанных данных в информационные системы, базы ГБУЗ «Морозовская детская городская клиническая
              больница Департамента здравоохранения города Москвы» с их последующей обработкой согласно действующему Законодательству РФ.
            </p>

`;
